      /*****************************************************************
      * Author(s):
      * Date:
      *
      /*****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

       DATA DIVISION.

       PROCEDURE DIVISION.
       DISPLAY "HELLO WORLD!"
       STOP RUN.
